In [1]:
import pandas as pd

# Crear el DataFrame
df = pd.DataFrame({
    "Estudiante": ["Ana", "Luis", "María", "Pedro", "Lucía"],
    "Matemática": [14, 17, 8, 12, 19],
    "Historia": [16, 14, 6, 10, 20],
    "Inglés": [12, 18, 4, 13, 15]
})

# Colocar 'Estudiante' como índice
df.set_index("Estudiante", inplace=True)

# Mostrar DataFrame
print(df)

            Matemática  Historia  Inglés
Estudiante
Ana                 14        16      12
Luis                17        14      18
María                8         6       4
Pedro               12        10      13
Lucía               19        20      15

In [2]:
# Tu código aquí:
ingles_series = df["Inglés"].copy(deep=True)
ingles_series

Estudiante
Ana      12
Luis     18
María     4
Pedro    13
Lucía    15
Name: Inglés, dtype: int64

In [3]:
#Ejercicio 2 – Crea un DataFrame con solo "historia_df = ..."
#Extrae la columna "historia_df = ..." como un DataFrame llamado historia_df.
historia_df = df[["Historia"]].copy(deep=True)
historia_df

            Historia
Estudiante
Ana               16
Luis              14
María              6
Pedro             10
Lucía             20

In [4]:
promedio_historia_df = historia_df.mean()
promedio_ingles_Series = ingles_series.mean()

In [5]:
promedio_historia_df

Historia    13.2
dtype: float64

In [6]:
promedio_ingles_Series

12.4

In [7]:
matematicas = df["Matemática"].copy(deep=True)
ordenadas = matematicas.sort_values()
ordenadas

Estudiante
María     8
Pedro    12
Ana      14
Luis     17
Lucía    19
Name: Matemática, dtype: int64

In [8]:
df

            Matemática  Historia  Inglés
Estudiante
Ana                 14        16      12
Luis                17        14      18
María                8         6       4
Pedro               12        10      13
Lucía               19        20      15

In [ ]:
 # Tu código aquí:
df["Promedio"] = df[["Matemática","Historia","Inglés"]].mean(axis=1)

In [13]:
df

            Matemática  Historia  Inglés   Promedio
Estudiante
Ana                 14        16      12  14.000000
Luis                17        14      18  16.333333
María                8         6       4   6.000000
Pedro               12        10      13  11.666667
Lucía               19        20      15  18.000000

In [14]:
# Tu código aquí:
aprobados =df[df["Promedio"]>15]
aprobados

            Matemática  Historia  Inglés   Promedio
Estudiante
Luis                17        14      18  16.333333
Lucía               19        20      15  18.000000